app/Controllers/Task1.php

    public function uploadFile()
    {
        if ($this->request->getFile('csv_file')) {
            $csvFile = $this->request->getFile('csv_file');

            if ($csvFile->isValid() && $csvFile->getExtension() === 'csv') {
                $inserted = 0;
                $duplicateCount = 0;
                $model = new UserModel();

                $csvData = array_map('str_getcsv', file($csvFile->getTempName()));

                foreach ($csvData as $data) {
                    $userData = [
                        'id' => $data[0],
                        'first_name' => $data[1],
                        'last_name' => $data[2],
                        'email' => $data[3]
                    ];

                    // email already exists check
                    $existingUser = $model->where('email', $userData['email'])->first();

                    if ($existingUser) {
                        //
                        $duplicateModel = new DuplicateCountModel();
                        $existingCount = $duplicateModel->where('email', $userData['email'])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'john@example.com'
 LIMIT 1
SELECT *
FROM `duplicate_count`
WHERE `email` = 'first_name'
 LIMIT 1

                        $duplicateCount++;
                    } else {
                        // Insert in to db
                        $model->insert($userData);
---
INSERT INTO `users` (`email`) VALUES ('john@example.com')