app/Controllers/Task2.php

SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT *
FROM `users`
 LIMIT 10, 10
---
    public function getUserDetails()
    {
        // the page number and search variable need to send form the frontend
        $page = $this->request->getVar('page') ?? 2;
        $perPage = $this->request->getVar('per_page') ?? 10;
        $search = $this->request->getVar('search') ?? '';

        $model = new UserModel();

        if (!empty($search)) {
            $model->like('first_name', $search)->orLike('last_name', $search)->orLike('email', $search);
        }

        // count of records
        $totalCount = $model->countAllResults(false);

        // pagination
        $model->limit($perPage, ($page - 1) * $perPage);

        $users = $model->findAll();

SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM (
SELECT *
FROM `users`
GROUP BY `email`
HAVING COUNT(*) > 1
) CI_count_all_results
---
    public function getDuplicatePercentage()
    {
        $model = new UserModel();

        // total count of records
        $totalCount = $model->countAllResults();

        // to count duplicate records
        $duplicateCount = $model->groupBy('email')->having('COUNT(*) >', 1)->countAllResults();